# Pandas operations

In [2]:
import numpy as np
import pandas as pd

In [12]:
df = pd.DataFrame({ 'col1' : [1,2,3,4], 'col2': [444,345,444,777], 'col3': ['abc', 'abcer', 'def', 'tye']})

In [7]:
df['col2'].nunique()

3

In [8]:
df['col2'].unique()

array([444, 345, 777])

In [9]:
df['col2'].value_counts()

444    2
777    1
345    1
Name: col2, dtype: int64

# Apply 
it is like mapping the given method to all the elements of the dataframe

In [13]:
df['col3'].apply(len)

0    3
1    5
2    3
3    3
Name: col3, dtype: int64

In [19]:
df.sort_values(by ='col2')

   col1  col2   col3
1     2   345  abcer
0     1   444    abc
2     3   444    def
3     4   777    tye

In [28]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Data input and output
We will read the following formats: csv, html, sql and excel

In [32]:
df = pd.read_csv("example")

In [34]:
df.to_csv("example_output",index=False)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [35]:
pd.read_csv("example_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [38]:
excel_data = pd.read_excel("Excel_Sample.xlsx", sheet_name = 'Sheet1')

In [40]:
excel_data.to_excel("Excel_Sample_1.xlsx",sheet_name = 'MySheet')

In [41]:
pd.read_excel("Excel_Sample_1.xlsx")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15